       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Malayme.

       PROCEDURE DIVISION.

           DISPLAY 'Hello World!'.

           STOP RUN.
