       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Yann.

       PROCEDURE DIVISION.

           DISPLAY 'Hello World!'.

           STOP RUN.
