       IDENTIFICATION DIVISION.
       PROGRAM-ID. Variables.
       AUTHOR. Malayme.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * NO SPACES IN ONE VARIABLE
      * VARIABLE TYPE WITH PIC FOLLOWED BY A, X OR 9
      * INITIALISATION VALUE PIC 9(4) VALUE 2021